{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ethical_persuasion",
    "1": "gaslighting",
    "2": "guilt_tripping",
    "3": "deflection",
    "4": "stonewalling",
    "5": "belittling_ridicule",
    "6": "love_bombing",
    "7": "threatening_intimidation",
    "8": "passive_aggression",
    "9": "appeal_to_emotion",
    "10": "whataboutism",
    "11": "neutral_conversation",
    "12": "coercive_control"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "appeal_to_emotion": 9,
    "belittling_ridicule": 5,
    "coercive_control": 12,
    "deflection": 3,
    "ethical_persuasion": 0,
    "gaslighting": 1,
    "guilt_tripping": 2,
    "love_bombing": 6,
    "neutral_conversation": 11,
    "passive_aggression": 8,
    "stonewalling": 4,
    "threatening_intimidation": 7,
    "whataboutism": 10
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
